import java.lang.reflect.Array;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

public class Person {

    private int age;
    private String name;

    public int getAge() {
        return age;
    }

    public void setAge(int age) {
        this.age=age;
    }

    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name=name;
    }


    public Person(String name, int age) {
        this.age=age;
        this.name=name;
    }

    @Override
    public String toString() {
        return "Person{" +
                "name='" + name + '\'' +
                ",age=" + age +
                '}';
    }

    public static List<Person> getTestList(){

        String[] names = new String[]{
                "Цветков Дмитрий Вадимович",
                "Абрамов Георгий Тимофеевич",
                "Исаев Прохор Германнович",
                "Кондратьев Остап Авксентьевич",
                "Евдокимов Макар Протасьевич",
                "Костин Осип Эдуардович",
                "Александров Ким Агафонович",
                "Самойлов Савелий Тимофеевич",
                "Селезнёв Лука Михайлович",
                "Мышкин Парамон Вениаминович",
                "Якушев Нинель Парфеньевич",
                "Лыткин Адам Федорович",
                "Савельев Август Серапионович",
                "Воронцов Орест Евгеньевич",
                "Максимов Зиновий Богданович",
                "Емельянов Андрей Наумович",
                "Родионов Натан Николаевич",
                "Потапов Макар Германович",
                "Петухов Вячеслав Дмитриевич",
                "Устинов Леонард Парфеньевич",
                "Борисова Эмилия Петровна",
                "Соловьёва Анисья Егоровна",
                "Гришина Эрика Федоровна",
                "Белякова Лиана Евгеньевна",
                "Костина Христина Филатовна",
                "Доронина Лаура Альвиановна",
                "Титова Антонина Семёновна",
                "Соловьёва Арина Федосеевна",
                "Гусева Эльвина Святославовна",
                "Князева Грета Тимуровна",
                "Корнилова Даниэла Владленовна",
                "Кудрявцева Магдалина Прокловна",
                "Григорьева Симона Игоревна",
                "Кулакова Карина Мэлоровна",
                "Филиппова Динара Егоровна",
                "Беляева Амира Анатольевна",
                "Котова Любава Дмитриевна",
                "Никифорова Анисья Ильяовна",
                "Корнилова Марианна Вениаминовна",
                "Никитина Агния Пётровна"};

        ArrayList<Person> people = new ArrayList <>();
        int i =0;
        for (String e: names) {
            i++;
            people.add(new Person(e, 10+i));
        }
        return people;
    }


}


